(package! dotenv-mode)
(package! leetcode)

(package! instant-rename-tag
  :recipe (:host github
           :repo "manateelazycat/instant-rename-tag"))
(package! js-doc)
(package! js-react-redux-yasnippets)
(package! jest)
(package! prettier-js)
(package! ob-typescript)
(package! web-beautify)

(package! move-text)
(package! org-bullets)
(package! engine-mode)
(package! sudo-edit)

(package! bm)
(package! imenu-list)
(package! git-gutter)
(package! projector)
(package! yasnippet-snippets)

(disable-packages! bookmark tide eldoc grip-mode)
